Blynk-Technologies/Edgent-Arduino/src/nm_esp8266/NetMgrWiFi.h
/**
 * @author     Volodymyr Shymanskyy
 * @copyright  Copyright (c) 2026 Volodymyr Shymanskyy
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef NetMgrEsp8266WiFi_h
#define NetMgrEsp8266WiFi_h

#include <NetMgrUtils.h>
#include <ESP8266WiFi.h>
#include <Preferences.h>
#include <list>

#define NETMGR_WIFI_PREFS_NS      "nm_wifi"
#define NETMGR_WIFI_MAX_NETWORKS  16
#define NETMGR_WIFI_SCAN_ITVL_MIN 3
#define NETMGR_WIFI_SCAN_ITVL_MAX (5 * 60)

#define NETMGR_WIFI_SCAN_TIMEOUT_MS 15000
#define NETMGR_WIFI_CONN_TIMEOUT_MS 25000

class NetMgrEsp8266WiFi {
    class ApEntry {
    public:
        ApEntry(int8_t id)
            : id(id), rssi(0), channel(0), hidden(false) {
            memset(bssid, 0, sizeof(bssid));
        }

        // Dynamic
        int8_t id;
        int rssi;

        // Persistent
        String ssid;
        String psk;
        uint8_t bssid[6];
        uint8_t channel;
        bool hidden;

        IPAddress localIP, gateway, subnet;
        IPAddress dns1, dns2;

    public:
        bool hasBSSID() const {
            return macIsValid(bssid);
        }

        size_t save(uint8_t* buff, size_t size) const {
            NetMgrBufferWriter tlv(buff, size);
            if (ssid.length()) {
                tlv.writeUInt8(FIELD_SSID);
                tlv.write(ssid);
            }
            if (psk.length()) {
                tlv.writeUInt8(FIELD_PSK);
                tlv.write(psk);
            }
            if (hasBSSID()) {
                tlv.writeUInt8(FIELD_BSSID);
                tlv.write(bssid, sizeof(bssid));
            }
            if (channel) {
                tlv.writeUInt8(FIELD_CHANNEL);
                tlv.writeUInt8(channel);
            }
            if (hidden) { tlv.writeUInt8(FIELD_HIDDEN); }

            if (localIP) {
                tlv.writeUInt8(FIELD_LOCAL_IP);
                tlv.write(localIP);
            }
            if (gateway) {
                tlv.writeUInt8(FIELD_GATEWAY);
                tlv.write(gateway);
            }
            if (subnet) {
                tlv.writeUInt8(FIELD_MASK);
                tlv.write(subnet);
            }
            if (dns1) {
                tlv.writeUInt8(FIELD_DNS);
                tlv.write(dns1);
            }
            if (dns2) {
                tlv.writeUInt8(FIELD_DNS);
                tlv.write(dns2);
            }

            return tlv.getOffset();
        }

        bool load(const uint8_t* buff, size_t size) {
            NetMgrBufferReader tlv(buff, size);
            uint8_t tag;
            int dnsIdx = 0;
            while (tlv.readUInt8(tag)) {
                switch (tag) {
                    case FIELD_SSID: tlv.read(ssid); break;
                    case FIELD_PSK: tlv.read(psk); break;
                    case FIELD_BSSID: tlv.read(bssid, sizeof(bssid)); break;
                    case FIELD_CHANNEL: tlv.readUInt8(channel); break;
                    case FIELD_HIDDEN: hidden = true; break;

                    case FIELD_LOCAL_IP: tlv.read(localIP); break;
                    case FIELD_GATEWAY: tlv.read(gateway); break;
                    case FIELD_MASK: tlv.read(subnet); break;
                    case FIELD_DNS: {
                        if (dnsIdx++ == 0) {
                            tlv.read(dns1);
                        } else {
                            tlv.read(dns2);
                        }
                    } break;
                    default:
                        return 0;
                }
            }
            return tlv.getOffset() == size;
        }

    private:
        // WARNING: these constants should not be modified,
        //          only new values can be added
        enum FieldTag : uint8_t {
            FIELD_SSID = 1,    // length: 0..255
            FIELD_PSK = 2,    // length: 0..255
            FIELD_BSSID = 3,    // length: 6
            FIELD_CHANNEL = 4,    // length: 1
            FIELD_HIDDEN = 5,    // length: 0

            FIELD_LOCAL_IP = 10,   // length: 4
            FIELD_GATEWAY = 11,   // length: 4
            FIELD_MASK = 12,   // length: 4
            FIELD_DNS = 13,   // length: 4
        };
    };

    typedef std::list<ApEntry> ApList;

public:
    enum State {
        NETMGR_IDLE,
        NETMGR_START_DOWN,
        NETMGR_WAIT_SCAN,
        NETMGR_START_SCANNING,
        NETMGR_SCANNING,
        NETMGR_START_CONNECTING,
        NETMGR_CONNECTING,
        NETMGR_CONNECTED,

        NETMGR_STATE_QTY
    } _state;

    enum Error {
        NETMGR_ERR_NONE,
        NETMGR_ERR_NETWORK_NOT_FOUND,
        NETMGR_ERR_AUTH_FAILED,
        NETMGR_ERR_IP_NOT_ASSIGNED,
        NETMGR_ERR_UNKNOWN,

        NETMGR_ERROR_QTY
    } _error;

    const char* getStateStr(State s) {
        static const char* StateStr[NETMGR_STATE_QTY] = {
            "IDLE",
            "START_DOWN",
            "WAIT_SCAN",
            "START_SCANNING",
            "SCANNING",
            "START_CONNECTING",
            "CONNECTING",
            "CONNECTED"
        };
        return StateStr[s];
    }

    const char* getErrorStr(Error e) {
        static const char* ErrorStr[NETMGR_ERROR_QTY] = {
            NULL,
            "NETWORK_NOT_FOUND",
            "AUTH_FAILED",
            "IP_NOT_ASSIGNED",
            "UNKNOWN"
        };
        return ErrorStr[e];
    }

public:
    NetMgrEsp8266WiFi() {}

    ~NetMgrEsp8266WiFi() {
        this->off();
    }

    void begin() {
        WiFi.persistent(false);
        WiFi.setAutoReconnect(false);
        WiFi.setHostname(_hostname.c_str());

        resetScanInterval();
        loadNetworks();
    }

    void startConfig() {
        WiFi.enableSTA(true);
    }

    bool isConfigured() {
        return _apList.size() > 0;
    }

    void on() {
        if (_state == NETMGR_IDLE) {
            _error = NETMGR_ERR_NONE;

            resetScanInterval();

            if (_lruId >= 0) {
                for (auto it = _apList.begin(); it != _apList.end(); ++it) {
                    ApEntry& ap = *it;
                    if (ap.id == _lruId && macIsValid(ap.bssid)) {
                        ApEntry foundAP = ap; // make a copy
                        _foundList.push_back(foundAP);
                        _foundBest = &_foundList.back();
                        setState(NETMGR_START_CONNECTING);
                        return;
                    }
                }
            }

            setState(NETMGR_START_SCANNING);
        }
    }

    void off() {
        setState(NETMGR_START_DOWN);
    }

    void setHostname(const String& hostname) {
        _hostname = hostname;
        _hostname.replace(" ", "-");
    }

    bool isHardwareAvailable() {
        return true;
    }

    bool supportsScan() { return true; }
    bool supports5GHz() { return false; }
    bool supportsStaticIP() { return true; }

