Blynk-Technologies/Edgent-Arduino/src/nm_esp8266/NetMgrWiFi.h
    bool isConnected() {
        return (WiFi.status() == WL_CONNECTED &&
                ipIsValid(WiFi.localIP()));
    }

    Error getError() const {
        return _error;
    }

    const char* getErrorStr() {
        return getErrorStr(_error);
    }

    const char* getStateStr() {
        return getStateStr(_state);
    }

    String getMacAddress() {
        byte mac[6];
        memset(mac, 0, sizeof(mac));
        WiFi.macAddress(mac);
        return macToString(mac);
    }

    String getLocalIP() {
        return ipToString(WiFi.localIP());
    }

    String getStatus() {
        if (_state == NETMGR_IDLE) {
            return "off";
        } else if (WiFi.status() == WL_CONNECTED) {
            if (WiFi.localIP()) {
                return "ready";
            } else {
                return "up";
            }
        } else {
            return "down";
        }
        return "unknown";
    }

    String getNetworkSSID() {
        return WiFi.SSID();
    }

    String getNetworkBSSID() {
        return WiFi.BSSIDstr();
    }

    int getRSSI() {
        return WiFi.RSSI();
    }

    String getApBSSID() {
        return WiFi.softAPmacAddress();
    }

    int scanNetworks() {
        return WiFi.scanNetworks(false, true);
    }

    void scanDelete() {
        WiFi.scanDelete();
    }

    bool scanGetResult(int i, String& ssid, String& sec,
                       int& rssi, String& bssid, int& chan) {
        struct {
            uint8_t sec = 0;
            uint8_t* bssid = NULL;
            bool hidden = false;
        } res;
        if (!WiFi.getNetworkInfo(i, ssid, res.sec,
                                 rssi, res.bssid,
                                 chan, res.hidden) ||
            !res.bssid) {
            return false;
        }
        sec = wifiSecToStr(res.sec);
        bssid = macToString(res.bssid);
        return true;
    }

    bool addNetwork(const String& ssid) {
        return addNetwork(ssid, "");
    }

    bool addNetwork(const String& ssid, const String& psk) {
        LOG_I("Add DHCP network config SSID=%s PSK_len=%d", ssid.c_str(), psk.length());
        return addNetwork(ssid, psk, IPAddress(), IPAddress(), IPAddress(), IPAddress(), IPAddress());
    }

    bool addNetwork(const String& ssid,
                    const String& psk,
                    const String& ipStr,
                    const String& gwStr,
                    const String& maskStr,
                    const String& dns1Str,
                    const String& dns2Str) {
        LOG_I("Add static network config SSID=%s PSK_len=%d IP=%s GW=%s MASK=%s DNS1=%s DNS2=%s",
              ssid.c_str(), psk.length(), ipStr.c_str(), gwStr.c_str(),
              maskStr.c_str(), dns1Str.c_str(), dns2Str.c_str());

        auto toIP = [](const String& s) -> IPAddress {
            IPAddress ip;
            if (s.length() && ip.fromString(s)) {
                return ip;
            }
            return IPAddress();
        };

        IPAddress ip = toIP(ipStr);
        IPAddress gw = toIP(gwStr);
        IPAddress mask = toIP(maskStr);
        IPAddress dns1 = toIP(dns1Str);
        IPAddress dns2 = toIP(dns2Str);

        // Only the second DNS specified => use it as the primary one
        if (!dns1 && dns2) {
            dns1 = dns2;
            dns2 = IPAddress();
        }

        return addNetwork(ssid, psk, ip, gw, mask, dns1, dns2);
    }

    bool addNetwork(const String& ssid,
                    const String& psk,
                    const IPAddress& IP,
                    const IPAddress& GW,
                    const IPAddress& Mask,
                    const IPAddress& DNS1,
                    const IPAddress& DNS2) {
        if (!ssid.length() || ssid.length() > 31) {
            LOG_E("No ssid or ssid too long");
            return false;
        }

        if (psk.length()) {
            if (psk.length() > 64) {
                LOG_E("Passphrase too long");
                return false;
            } else if (psk.length() < 8) {
                LOG_E("Passphrase too short");
                return false;
            }
        }

        // Replace existing network with the same SSID
        for (auto it = _apList.begin(); it != _apList.end(); ++it) {
            ApEntry& ap = *it;
            if (ap.ssid == ssid) {
                int existingID = ap.id;

                ApEntry newAP(existingID);
                newAP.ssid = ssid;
                newAP.psk = psk;
                newAP.localIP = IP;
                newAP.gateway = GW;
                newAP.subnet = Mask;
                newAP.dns1 = DNS1;
                newAP.dns2 = DNS2;

                if (saveNetwork(newAP)) {
                    *it = newAP;
                    //it = _apList.erase(it);
                    //_apList.insert(it, newAP);
                    setState(NETMGR_START_SCANNING);
                    return true;
                }
                return false;
            }
        }

        // Create new entry (possibly overwriting the oldest one)
        ApEntry newAP(_nextId);
        newAP.ssid = ssid;
        newAP.psk = psk;
        newAP.localIP = IP;
        newAP.gateway = GW;
        newAP.subnet = Mask;
        newAP.dns1 = DNS1;
        newAP.dns2 = DNS2;

        // Save incomplete AP info immediately
        Preferences prefs;
        if (prefs.begin(NETMGR_WIFI_PREFS_NS)) {
            if (saveNetwork(prefs, newAP)) {
            // Add item to the list
                _apList.push_back(newAP);

            // Update nextID
                _nextId = (_nextId + 1) % NETMGR_WIFI_MAX_NETWORKS;
                prefs.putUShort("apID", _nextId);

            // Apply max APs count
                while (_apList.size() > NETMGR_WIFI_MAX_NETWORKS) {
                    _apList.pop_front();
                }

                if (_apList.size() == 1) {
                    ApEntry foundAP = _apList.front(); // make a copy
                    _foundList.push_back(foundAP);
                    _foundBest = &_foundList.back();
                    setState(NETMGR_START_CONNECTING);
                    return true;
                } else {
                    setState(NETMGR_START_SCANNING);
                    return true;
                }
            }
        }

