Blynk-Technologies/Edgent-Arduino/src/nm_esp8266/NetMgrWiFi.h
        return false;
    }

    void clearNetworks() {
        _nextId = 0;
        _lruId = -1;
        _foundBest = NULL;
        _foundList.clear();
        _apList.clear();
        eraseNetworks();
        // Stop the state machine: it may be pointing at a network
        // that has just been removed
        setState(NETMGR_IDLE);
    }

    void run() {
        switch (_state) {
            case NETMGR_IDLE: {
            // Idle
            } break;
            case NETMGR_START_DOWN: {
                WiFi.mode(WIFI_OFF);
                setState(NETMGR_IDLE);
            } break;
            case NETMGR_WAIT_SCAN: {
                if (millis() - _lastScanTime > _scanInterval * 1000) {
                    setState(NETMGR_START_SCANNING);
                }
            } break;
            case NETMGR_START_SCANNING: {
                if (!_apList.size()) {
                    setState(NETMGR_IDLE);
                    return;
                }
                _lastScanTime = millis();
            //                          async|hidden
                int res = WiFi.scanNetworks(true, false);
                if (res == WIFI_SCAN_RUNNING || res >= 0) {
                    setState(NETMGR_SCANNING);
                } else {
                    LOG_D("Scanning not started");
                    resetScanInterval();
                    setState(NETMGR_WAIT_SCAN);
                }
            } break;
            case NETMGR_SCANNING: {
                const int scanResult = WiFi.scanComplete();
                const bool timeout = (millis() - _lastStateTime > NETMGR_WIFI_SCAN_TIMEOUT_MS);
                if (scanResult >= 0) {
                    processScanResults(scanResult);

                    LOG_I("Found APs: %d, known: %d, time: %lu ms",
                          scanResult, _foundList.size(),
                          millis() - _lastScanTime);

                    if (isConnected()) {
                        setState(NETMGR_CONNECTED);
                    } else if ((_foundBest = findBestNetwork())) {
                        setState(NETMGR_START_CONNECTING);
                    } else {
                        increaseScanInterval();
                        setState(NETMGR_WAIT_SCAN);
                    }
                } else if (timeout || scanResult != WIFI_SCAN_RUNNING) {
                    if (timeout) {
                        LOG_W("Scan timeout");
                    } else {
                        LOG_W("Scan error: %d", scanResult);
                    }
                    WiFi.scanDelete();
                    WiFi.disconnect(true, true);
                    setState(NETMGR_START_SCANNING);
                }
            } break;
            case NETMGR_START_CONNECTING: {
                if (!_foundBest) {
                    setState(NETMGR_WAIT_SCAN);
                    return;
                }
                bool isDHCP = !_foundBest->localIP;
                if (isDHCP) {
                    LOG_I("WiFi connect: %s (%s) ch:%d DHCP",
                          _foundBest->ssid.c_str(),
                          macToString(_foundBest->bssid).c_str(),
                          _foundBest->channel);
                } else {
                    LOG_I("WiFi connect: %s (%s) ch:%d STATIC IP:%s MASK:%s GW:%s DNS1:%s DNS2:%s",
                          _foundBest->ssid.c_str(),
                          macToString(_foundBest->bssid).c_str(),
                          _foundBest->channel,
                          _foundBest->localIP.toString().c_str(),
                          _foundBest->subnet.toString().c_str(),
                          _foundBest->gateway.toString().c_str(),
                          _foundBest->dns1.toString().c_str(),
                          _foundBest->dns2.toString().c_str());
                }
                _error = NETMGR_ERR_NONE;
                WiFi.mode(WIFI_STA);
                WiFi.disconnect();

                WiFi.setHostname(_hostname.c_str());
                if (_foundBest->localIP) {
                // If dns2 is zero, WiFi.config will treat it as 0.0.0.0 (ok).
                    WiFi.config(_foundBest->localIP, _foundBest->gateway, _foundBest->subnet, _foundBest->dns1, _foundBest->dns2);
                } else {
                    WiFi.config(IPAddress(), IPAddress(), IPAddress()); // ensure DHCP
                }
                if (WiFi.begin(_foundBest->ssid.c_str(),
                               _foundBest->psk.c_str(),
                               _foundBest->channel,
                               macIsValid(_foundBest->bssid) ? _foundBest->bssid : NULL)) {
                    setState(NETMGR_CONNECTING);
                } else {
                    LOG_W("Cannot start connection");
                    WiFi.disconnect(true);
                    setState(NETMGR_START_SCANNING);
                }
            } break;
            case NETMGR_CONNECTING: {
                if (millis() - _lastCheckTime > 10) {
                    _lastCheckTime = millis();
                    const int status = WiFi.status();
                    const bool timeout = (millis() - _lastStateTime > NETMGR_WIFI_CONN_TIMEOUT_MS);
                    if (status == WL_CONNECTED) {
                        LOG_I("WiFi connected "
                              "(BSSID: %s, IP: %s, MASK: %s, GW: %s, DNS1: %s, DNS2: %s, RSSI: %d)",
                              WiFi.BSSIDstr().c_str(),
                              WiFi.localIP().toString().c_str(),
                              WiFi.subnetMask().toString().c_str(),
                              WiFi.gatewayIP().toString().c_str(),
                              WiFi.dnsIP(0).toString().c_str(),
                              WiFi.dnsIP(1).toString().c_str(),
                              WiFi.RSSI());

                        Preferences prefs;
                        if (_foundBest && prefs.begin(NETMGR_WIFI_PREFS_NS)) {
                        // Check if AP info needs to be updated
                            for (auto it = _apList.begin(); it != _apList.end(); ++it) {
                                ApEntry& ap = *it;
                                if (!ap.hasBSSID() && ap.id == _foundBest->id) {
                                    memcpy(ap.bssid, _foundBest->bssid, sizeof(ap.bssid));
                                    ap.channel = _foundBest->channel;

                                // Save the updated info
                                    saveNetwork(prefs, ap);
                                    break;
                                }
                            }

                        // Save LRU ID
                            if (_lruId != _foundBest->id) {
                                _lruId = _foundBest->id;
                                prefs.putShort("lru", _lruId);
                                LOG_D("LRU set to %d", _lruId);
                            }
                        }

                        getNtpTime();
                        setState(NETMGR_CONNECTED);
                    } else if (status == WL_NO_SSID_AVAIL) {
                        LOG_E("Connecting failed: AP not found");
                        WiFi.disconnect(true);
                        setState(NETMGR_START_SCANNING);
                    } else if (status == WL_CONNECT_FAILED || timeout) {
                        if (_error == NETMGR_ERR_AUTH_FAILED) {
                            LOG_E("Connecting failed: Authentication failed (wrong password?)");
                        } else if (timeout) {
                            LOG_E("Connecting failed: timeout");
                        } else {
                            LOG_E("Connecting failed");
                        }
                        WiFi.disconnect(true);
                        if (_foundBest) {
                            _foundBest->rssi = 0; // exclude from next connection
                        }
                        if ((_foundBest = findBestNetwork())) {
                            setState(NETMGR_START_CONNECTING);
                        } else {
                            increaseScanInterval();
                            setState(NETMGR_WAIT_SCAN);
                        }
                    }
                }
            } break;
            case NETMGR_CONNECTED: {
                if (WiFi.status() != WL_CONNECTED) {
                    LOG_W("Lost network");
                    resetScanInterval();
                    setState(NETMGR_START_SCANNING);
                }
            } break;
            default: {
                setState(NETMGR_IDLE);
            }
        }
    }

