Blynk-Technologies/Edgent-Arduino/src/nm_esp8266/NetMgrWiFi.h
public:
    static const char* wifiSecToStr(int sec) {
        switch (sec) {
            case ENC_TYPE_NONE: return "OPEN";
            case ENC_TYPE_WEP: return "WEP";
            case ENC_TYPE_TKIP: return "WPA";
            case ENC_TYPE_CCMP: return "WPA2";
            case ENC_TYPE_AUTO: return "WPA+WPA2";
            default: return "unknown";
        }
    }

private:
    void setState(State s) {
        if (_state != s) {
            LOG_D("%s -> %s", getStateStr(_state), getStateStr(s));
        }
        _state = s;
        _lastCheckTime = _lastStateTime = millis();
    }

    ApEntry* findBestNetwork() {
        ApEntry* result = NULL;
        int bestRSSI = INT_MIN;
        for (auto it = _foundList.begin(); it != _foundList.end(); ++it) {
            ApEntry& entry = *it;
            if (entry.rssi < 0 && bestRSSI < entry.rssi) {
                bestRSSI = entry.rssi;
                result = &entry;
            }
        }
        return result;
    }

    void processScanResults(const int scanResult) {
        _foundList.clear();
        _foundBest = NULL;

        for (int i = 0; i < scanResult; ++i) {
            String ssid_scan;
            int32_t rssi_scan;
            uint8_t sec_scan;
            uint8_t* bssid_scan;
            int32_t chan_scan;
            bool hid_scan;

            bool res = WiFi.getNetworkInfo(i, ssid_scan, sec_scan, rssi_scan, bssid_scan, chan_scan, hid_scan);
            if (!res || !bssid_scan) {
                continue;
            }

            bool known = false;
            for (auto it = _apList.rbegin(); it != _apList.rend(); ++it) {
                ApEntry& entry = *it;

                if ((ssid_scan == entry.ssid) &&
                    ((sec_scan == ENC_TYPE_NONE && !entry.psk.length()) ||
                     (sec_scan != ENC_TYPE_NONE && entry.psk.length()))) {
                    ApEntry foundAP = entry; // make a copy

                    memcpy(foundAP.bssid, bssid_scan, sizeof(foundAP.bssid));
                    foundAP.channel = chan_scan;
                    foundAP.rssi = rssi_scan;

                    _foundList.push_back(foundAP);

                    known = true;
                    break;
                }
            }

            (void)known;

            LOG_D(" %s  %d: [%d][%s] %s (%d) %c", known ? ">" : " ", i, chan_scan,
                  macToString(bssid_scan).c_str(), ssid_scan.c_str(),
                  rssi_scan, (sec_scan == ENC_TYPE_NONE) ? ' ' : '*');
        }
        WiFi.scanDelete();
    }

    void getNtpTime() {
        const uint32_t tstart = millis();
        time_t now = time(nullptr);
        if (now < 1672531200) { // Jan 01, 2023
            configTime(0, 0, "pool.ntp.org", "time.nist.gov");

            while ((now < 1672531200) &&
                   (millis() - tstart < 3000)) {
                delay(10);
                now = time(nullptr);
            }

            struct tm timeinfo;
            gmtime_r(&now, &timeinfo);
            String ntpTime = asctime(&timeinfo);
            ntpTime.trim();
            LOG_I("Time: %s", ntpTime.c_str());
        }
    }

    bool loadNetwork(Preferences& prefs, int id) {
        char key[8];
        snprintf(key, sizeof(key), "ap%02d", id);
        if (prefs.isKey(key)) {
            uint8_t buf[256];
            size_t len = prefs.getBytes(key, buf, sizeof(buf));
            ApEntry ap(id);
            if (len && ap.load(buf, len)) {
                LOG_D("Loaded %s, ssid: %s, bssid: %s", key, ap.ssid.c_str(), macToString(ap.bssid).c_str());
                _apList.push_back(ap);
                return true;
            } else {
                LOG_W("Cannot load %s (%d bytes)", key, len);
            }
        }
        return false;
    }

    void loadNetworks() {
        Preferences prefs;
        if (prefs.begin(NETMGR_WIFI_PREFS_NS, true)) { // read-only
            if (prefs.isKey("apID")) {
                _nextId = prefs.getUShort("apID", 0);
                // Ensure next ID is in range
                _nextId = min(_nextId, NETMGR_WIFI_MAX_NETWORKS - 1);
            }

            // Load networks starting from the oldest one
            for (int id = _nextId; id < NETMGR_WIFI_MAX_NETWORKS; id++) {
                loadNetwork(prefs, id);
            }
            for (int id = 0; id < _nextId; id++) {
                loadNetwork(prefs, id);
            }

            if (prefs.isKey("lru")) {
                _lruId = prefs.getShort("lru", -1);
                LOG_D("LRU ID: %d", _lruId);
            }
        }
    }

    bool saveNetwork(Preferences& prefs, const ApEntry& ap) {
        char key[8];
        snprintf(key, sizeof(key), "ap%02d", ap.id);
        uint8_t buf[256];
        size_t len = ap.save(buf, sizeof(buf));
        if (len && prefs.putBytes(key, buf, len) == len) {
            LOG_D("Saved SSID: %s, ID: %d (%d bytes)", ap.ssid.c_str(), ap.id, len);
            return true;
        }
        LOG_E("Cannot save SSID: %s, ID: %d", ap.ssid.c_str(), ap.id);
        return false;
    }

    bool saveNetwork(const ApEntry& ap) {
        Preferences prefs;
        if (prefs.begin(NETMGR_WIFI_PREFS_NS)) {
            return saveNetwork(prefs, ap);
        }
        return false;
    }

    void eraseNetworks() {
        Preferences prefs;
        if (prefs.begin(NETMGR_WIFI_PREFS_NS)) {
            prefs.clear();
        }
    }

    void resetScanInterval() {
        _scanInterval = NETMGR_WIFI_SCAN_ITVL_MIN;
    }

    void increaseScanInterval() {
        if (_scanInterval < NETMGR_WIFI_SCAN_ITVL_MIN) {
            _scanInterval = NETMGR_WIFI_SCAN_ITVL_MIN;
        } else if (_scanInterval < NETMGR_WIFI_SCAN_ITVL_MAX) {
            _scanInterval = _scanInterval * 1.7;
            if (_scanInterval > NETMGR_WIFI_SCAN_ITVL_MAX) {
                _scanInterval = NETMGR_WIFI_SCAN_ITVL_MAX;
            }
            LOG_D("Scan interval: %lu", _scanInterval);
        }
    }

private:
    uint32_t _lastScanTime = 0;
    uint32_t _lastStateTime = 0;
    uint32_t _lastCheckTime = 0;
    uint32_t _scanInterval;
    int _nextId = 0;
    int _lruId = -1;
    ApList _apList;
    ApList _foundList;
    ApEntry* _foundBest = NULL;
    String _hostname;
};

#endif /* NetMgrEsp8266WiFi_h */
